
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	ПользовательИБ = Справочники.Пользователи.НайтиПоНаименованию(ТекущийПользователь.ПолноеИмя);
	
	Если ПользовательИБ = Справочники.Пользователи.ПустаяСсылка() тогда
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Наименование = ТекущийПользователь.ПолноеИмя;
		НовыйПользователь.Записать();
		ПользовательИБ = НовыйПользователь.Ссылка;
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийПользователь = ПользовательИБ;
	
КонецПроцедуры
