
&НаКлиенте
Процедура Зарегистрировать(Команда)
	
	ТребуемаяВерсия = Элементы.ТаблицаВнешнихКомпонент.ТекущиеДанные.ВерсияКомпоненты;
	
	НастроитьКоннектор(ТребуемаяВерсия);
	
КонецПроцедуры

&НаКлиенте
Функция ОбновитьКлючРеестра(знач Ключ, знач ТребуемаяВерсия)
	
	WshShell = Новый COMОбъект("WScript.Shell");
	
	Попытка
		Значение = WshShell.RegRead(Ключ);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В реестре не найдена ветка с текущей версией COM";
		Сообщение.Сообщить();
		Возврат ложь;
	КонецПопытки;
		Значение1= СтрЗаменить(Значение, "\", Символы.ПС);
	ВерсияОпределена = ложь;
	Для ТекНомер=1 По СтрЧислоСтрок(Значение1) Цикл
		ТекущаяВерсия = СтрПолучитьСтроку(Значение1, ТекНомер);
		Если Лев(ТекущаяВерсия,2)="8." Тогда
			ВерсияОпределена = истина;
			прервать;
		КонецЕсли; 
	КонецЦикла; 
	Если ВерсияОпределена и ТекущаяВерсия<>ТребуемаяВерсия Тогда
		Значение = СтрЗаменить(Значение, ТекущаяВерсия, ТребуемаяВерсия);
		WshShell.RegWrite(Ключ, Значение);
		Возврат Истина;
	иначе 
		Возврат ложь;
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура НастроитьКоннектор(знач ТребуемаяВерсия)
	Если СтрНайти(ТребуемаяВерсия, "8.3") Тогда
		КлючРеестра = "HKEY_CLASSES_ROOT\CLSID\{181E893D-73A4-4722-B61D-D604B3D67D47}\InprocServer32\";
	Иначе
		КлючРеестра = "HKEY_CLASSES_ROOT\CLSID\{2B0C1632-A199-4350-AA2D-2AEE3D2D573A}\InprocServer32\";
	КонецЕсли;
	Обновлен = ОбновитьКлючРеестра(КлючРеестра, ТребуемаяВерсия);
	Если Обновлен Тогда
		ЗапуститьПриложение("taskkill.exe /f /im dllhost.exe",,Истина);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФСО=Новый COMОбъект("Scripting.FileSystemObject");
	Папки1С = Новый Массив;
	Папки1С.Добавить("1cv82");
	Папки1С.Добавить("1cv8");

	//Получаем папки Programm files 
	ПапкиСПрограммами = Новый Массив;
	//Производим поиск нужной версии платформы
	ФСО = Новый COMОбъект("Scripting.FileSystemObject");
	
	КореньДиска = ФСО.GetFolder("C:\").SubFolders;
	//По умолчанию корнем всегда является диск C
	Для каждого ПапкаКорня из КореньДиска цикл
		Если ПапкаКорня.Name =  "Program Files" ИЛИ ПапкаКорня.Name = "Program Files (x86)"Тогда
			ПапкиСПрограммами.Добавить(ПапкаКорня.Name);
		КонецЕсли;		
	КонецЦикла;

	//Обходим каждую программ филес и находим нужную программу
	Для каждого ПапкаСПрограммами из ПапкиСПрограммами цикл
		ПапкиПрограмм = ФСО.GetFolder("C:\"+ПапкаСПрограммами+"\").SubFolders;
		//Проверяем каждую папку с программой
		Для Каждого ПапкаПрограммы из ПапкиПрограмм цикл
			ИндексПапки1С =Папки1С.Найти(ПапкаПрограммы.Name); 
			Если ИндексПапки1С <> Неопределено тогда
				ВерсииПрограмм = ФСО.GetFolder("C:\"+ПапкаСПрограммами+"\"+Папки1С[ИндексПапки1С]+"\").SubFolders;
				Для каждого ВерсияПрограммы из ВерсииПрограмм цикл
					Если СтрНайти(ВерсияПрограммы.Name, "8.")  Тогда
						
						//На этом моменте добавляем версию программы и строку пути к файлу в ТаблицаВнешнихКомпонент
						НоваяСтрокаТаблицы = ТаблицаВнешнихКомпонент.Добавить();
						НоваяСтрокаТаблицы.ВерсияКомпоненты = ВерсияПрограммы.Name;
						НоваяСтрокаТаблицы.ПутьККомпоненте = "C:\"+ПапкаСПрограммами+"\"+Папки1С[ИндексПапки1С]+"\" +ВерсияПрограммы +"\bin\comcntr.dll";

					КонецЕсли; 
				КонецЦикла; 
				
				
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;  
	
	ТаблицаВнешнихКомпонент.Сортировать("ВерсияКомпоненты");
	
	
КонецПроцедуры
