
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Заполняем список пользователей
	ЗаполнитьДанныеНаФорме()
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНаФорме()
	
	//Заполняем список информационных баз
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеИнформационныхБаз.ИнформационнаяБаза КАК База
		|ИЗ
		|	РегистрСведений.СостояниеИнформационныхБаз КАК СостояниеИнформационныхБаз
		|ГДЕ
		|	СостояниеИнформационныхБаз.МониторингОшибокСинхронизации = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыПользователейСостав.Пользователь,
		|	ПользователиКонтактнаяИнформация.Значение КАК АдресЭП
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|		ПО ГруппыПользователейСостав.Пользователь = ПользователиКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	ГруппыПользователейСостав.Ссылка = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.МониторингОшибокСинхронизации)
		|	И ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	тзИнформационныеБазы 	= МассивРезультатов[0].Выгрузить();
	тзПользователи 						= МассивРезультатов[1].Выгрузить();
	
	СписокИнформационныхБаз.Загрузить(тзИнформационныеБазы);
	СписокПолучателей.Загрузить(тзПользователи);
	
	МониторингОшибокСинхронизации = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.МониторингОшибокСинхронизации);
	ИспользоватьМониторингОшибок = МониторингОшибокСинхронизации.Использование;
	ЧастотаПроверки = МониторингОшибокСинхронизации.Расписание.ПериодПовтораВТечениеДня / 60;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьДанныеНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	
	//////////////////////////////
	//ЗАПИСЬ СПИСКА БАЗ//
	//////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеИнформационныхБаз.ИнформационнаяБаза,
		|	ЛОЖЬ КАК МониторингОшибокСинхронизации
		|ПОМЕСТИТЬ ВТОтключитьМониторинг
		|ИЗ
		|	РегистрСведений.СостояниеИнформационныхБаз КАК СостояниеИнформационныхБаз
		|ГДЕ
		|	СостояниеИнформационныхБаз.МониторингОшибокСинхронизации = ИСТИНА
		|	И НЕ СостояниеИнформационныхБаз.ИнформационнаяБаза В (&СписокИнформационныхБаз)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнформационныеБазы.Ссылка КАК ИнформационнаяБаза,
		|	ИСТИНА КАК МониторингОшибокСинхронизации
		|ПОМЕСТИТЬ ВТВключитьМониторинг
		|ИЗ
		|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
		|ГДЕ
		|	ИнформационныеБазы.Ссылка В(&СписокИнформационныхБаз)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтключитьМониторинг.ИнформационнаяБаза,
		|	ВТОтключитьМониторинг.МониторингОшибокСинхронизации
		|ИЗ
		|	ВТОтключитьМониторинг КАК ВТОтключитьМониторинг
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТВключитьМониторинг.ИнформационнаяБаза,
		|	ВТВключитьМониторинг.МониторингОшибокСинхронизации
		|ИЗ
		|	ВТВключитьМониторинг КАК ВТВключитьМониторинг";
	
	Запрос.УстановитьПараметр("СписокИнформационныхБаз", СписокИнформационныхБаз.Выгрузить());
	
	ВыборкаИнформационныхБаз = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаИнформационныхБаз.Следующий() Цикл

		МенеджерЗаписиСостоянияБазы = РегистрыСведений.СостояниеИнформационныхБаз.СоздатьМенеджерЗаписи();
		МенеджерЗаписиСостоянияБазы.ИнформационнаяБаза = ВыборкаИнформационныхБаз.ИнформационнаяБаза;
		МенеджерЗаписиСостоянияБазы.Прочитать();
		Если МенеджерЗаписиСостоянияБазы.Выбран() Тогда
			МенеджерЗаписиСостоянияБазы.МониторингОшибокСинхронизации = ВыборкаИнформационныхБаз.МониторингОшибокСинхронизации;
		Иначе
			МенеджерЗаписиСостоянияБазы.ИнформационнаяБаза = ВыборкаИнформационныхБаз.ИнформационнаяБаза;
			МенеджерЗаписиСостоянияБазы.МониторингОшибокСинхронизации = ВыборкаИнформационныхБаз.МониторингОшибокСинхронизации;
		КонецЕсли;
		
		МенеджерЗаписиСостоянияБазы.Записать(Истина);
		
	КонецЦикла;
	
	
	///////////////////////////////////////////////
	//ЗАПИСЬ СПИСКА ПОЛЬЗОВАТЕЛЕЙ//
	///////////////////////////////////////////////
	
	ОбъектГруппыМониторинга = Справочники.ГруппыПользователей.МониторингОшибокСинхронизации.ПолучитьОбъект();
	ОбъектГруппыМониторинга.Состав.Очистить();
	ОбъектГруппыМониторинга.Состав.Загрузить(СписокПолучателей.Выгрузить());
	ОбъектГруппыМониторинга.Записать();
	
	/////////////////////////////////
	//ЗАПИСЬ РЕГЛ ЗАДАНИЯ//
	/////////////////////////////////
	
	МониторингОшибокСинхронизации = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.МониторингОшибокСинхронизации);
	МониторингОшибокСинхронизации.Использование = ИспользоватьМониторингОшибок;
	МониторингОшибокСинхронизации.Расписание.ПериодПовтораВТечениеДня = ЧастотаПроверки * 60;
	МониторингОшибокСинхронизации.Расписание.ПериодПовтораДней = 1;
	МониторингОшибокСинхронизации.Записать();
	
КонецПроцедуры
