
&НаКлиенте
Процедура ЗагрузитьПользователей(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, "Перед загрузкой данных будут удалены все текущие пользователи и профили доступа" + Символы.ПС
							+"Продолжить выполнение операции?", Режим, 0);
								
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьПользователейНаСервере(МассивБаз, УникальныйИдентификатор)
	
	//ЗагрузитьПользователейНаСервере(ВыбранноеЗначение);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = Нстр("ru = 'Загрузка пользователей.'");
	//ВыбранноеЗначение = МассивБаз	
	ПараметрыПроцедуры = Новый Структура("МассивБаз", МассивБаз);
	Результат = ДлительныеОперации.ВыполнитьВФоне(
	"РаботаСПользователями.ВыполнитьЗагрузкуПользователей", ПараметрыПроцедуры, ПараметрыВыполнения);
	
	Возврат  Результат;

КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ДлительнаяОперация = ЗагрузитьПользователейНаСервере(ВыбранноеЗначение, УникальныйИдентификатор);
	//ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Неопределено, ПараметрыОжидания);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("ВыбратьБазы", Истина);
	ОткрытьФорму("Обработка.РабочееМестоАдминистратора.Форма.РабочееМестоАдминистратора",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
