

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.РежимЗапуска = Перечисления.РежимЗапускаПриложения.УправляемоеПриложение;
	Иначе
		СостояниеИнформационнойБазы = РегистрыСведений.СостояниеИнформационныхБаз.СоздатьНаборЗаписей();
		СостояниеИнформационнойБазы.Отбор.ИнформационнаяБаза.Установить(Параметры.Ключ);
		СостояниеИнформационнойБазы.Прочитать();
		Для каждого СтрокаСостояние из СостояниеИнформационнойБазы цикл
			SQLБазаДанных = СтрокаСостояние.SQLБазаДанных;
			SQLСерверБазДанных = СтрокаСостояние.SQLСерверБазДанных;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

