
&НаКлиенте
Процедура КластерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВерсияПлатформы) Тогда
		ВерсияПлатформы = РаботаСПодключениямиCOM.ВерсияПлатформы();
	Иначе
		ВерсияПлатформы = Объект.ВерсияПлатформы;
	КонецЕсли;
	
	КластерыМассив = РаботаСПодключениямиCOM.ПолучитьКластеры(
		СокрЛП(Объект.АдресАгентаСервера),
		СокрЛП(Объект.ПортАгентаСервера),
		ВерсияПлатформы);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого Кластер Из КластерыМассив Цикл
		ДанныеВыбора.Добавить(Кластер, Кластер.ClusterName);
	КонецЦикла;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КластерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИмяКластера = ВыбранноеЗначение.ClusterName;
	ХостКластера =  ВыбранноеЗначение.HostName;
	ПортКластера = СтрЗаменить(Строка(ВыбранноеЗначение.Mainport)," ","");
	
	Объект.ПортКластера = ПортКластера;
	Объект.Кластер = ИмяКластера;
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = ХостКластера + ":" + ПортКластера;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
