
&НаКлиенте
Процедура СерверПриложения1СПриИзменении(Элемент)
	СерверПриложения1СПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СерверПриложения1СПриИзмененииНаСервере()
	БазыКластераТаблица = РаботаСПодключениямиCOM.ПолучитьБазыКластера(ЭтаФорма.Кластер);
	
	СписокИнформационныхБаз.Очистить();
	Для Каждого БазаКластера Из БазыКластераТаблица Цикл
		НоваяСтрока = СписокИнформационныхБаз.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,БазаКластера);
	КонецЦикла;
	
	СписокИнформационныхБаз.Сортировать("Name");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаИстина(Команда)
	Для каждого СтрокаТаблицы из СписокИнформационныхБаз цикл
		СтрокаТаблицы.Отметка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаЛожь(Команда)
	Для каждого СтрокаТаблицы из СписокИнформационныхБаз цикл
		СтрокаТаблицы.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыбранные(Команда)
	ЗагрузитьВыбранныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВыбранныеНаСервере()
	
	Для каждого СтрокаТаблицы из СписокИнформационныхБаз цикл
		Если СтрокаТаблицы.Отметка = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		НайденнаяБаза = Справочники.ИнформационныеБазы.НайтиПоРеквизиту("ИмяБазыВКластере", СтрокаТаблицы.Name);
		Если  НайденнаяБаза = Справочники.ИнформационныеБазы.ПустаяСсылка() Тогда
			ИнформационнаяБазаОбъект = Справочники.ИнформационныеБазы.СоздатьЭлемент();
		Иначе
			ИнформационнаяБазаОбъект = НайденнаяБаза.ПолучитьОбъект();
		КонецЕсли;
		
		ИнформационнаяБазаОбъект.Кластер = Кластер;
		ИнформационнаяБазаОбъект.ИмяБазыВКластере = СтрокаТаблицы.Name;
		ИнформационнаяБазаОбъект.Наименование = СтрокаТаблицы.Descr;
		ИнформационнаяБазаОбъект.Записать();
		
		СтрокаТаблицы.Ссылка = ИнформационнаяБазаОбъект.Ссылка;
	КонецЦикла;
	
КонецПроцедуры


