
Процедура ПередЗаписью(Отказ)
	НаименованиеТемп = СтрЗаменить(Наименование, ".", Символы.ПС);
	ВерсияМассив = Новый Массив;
	Для лчНом = 1 По СтрЧислоСтрок(НаименованиеТемп) Цикл
		ВерсияМассив.Добавить(СтрПолучитьСтроку(НаименованиеТемп, лчНом));
	КонецЦикла;
	
	//ВерсияМассив = СтрРазделить(Наименование, ".", Ложь);
	Если ВерсияМассив.Количество() <> 4 Тогда
		Отказ = Истина;
		ВызватьИсключение("Наименование не соответсвует формату [Число].[Число].[Число].[Число]!");
	КонецЕсли;
	
	Попытка
		ВерсияЧисло = Число(Прав("0000" + ВерсияМассив[0], 4) + Прав("0000" + ВерсияМассив[1], 4) + Прав("0000" + ВерсияМассив[2], 4) + Прав("0000" + ВерсияМассив[3], 4));
	Исключение
		ВызватьИсключение("Ошибка преобразования наименования " + Наименование + " в число!");
	КонецПопытки;
КонецПроцедуры
