
&НаКлиенте
Процедура ВыбратьКаталог(ЭлементВыбора)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ЭлементВыбора.СписокВыбора.Добавить(ДиалогОткрытияФайла.Каталог);
		Запись[ЭлементВыбора.Имя] = ДиалогОткрытияФайла.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайламДамповНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьКаталог(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОбновленияТиповыхКонфигурацийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьКаталог(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКРезервнымКопиямБазНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьКаталог(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуСравненияКонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьКаталог(Элемент);
КонецПроцедуры
