
Процедура УстановитьСостояниеИнформационнойБазы(ИнформационнаяБаза, СтруктураСостояния) Экспорт
	
	НаборЗаписейСостоянияБаз = РегистрыСведений.СостояниеИнформационныхБаз.СоздатьНаборЗаписей();
	НаборЗаписейСостоянияБаз.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
	НаборЗаписейСостоянияБаз.Прочитать();
	Если НаборЗаписейСостоянияБаз.Количество() = 0 Тогда
		ЗаписьСостоянияБазы = НаборЗаписейСостоянияБаз.Добавить();
	Иначе
		ЗаписьСостоянияБазы = НаборЗаписейСостоянияБаз[0];
	КонецЕсли;
	ЗаписьСостоянияБазы.ИнформационнаяБаза = ИнформационнаяБаза; 
	
	ЗаполнитьЗначенияСвойств(ЗаписьСостоянияБазы, СтруктураСостояния);
	
	НаборЗаписейСостоянияБаз.Записать();
	
КонецПроцедуры

Процедура ЗаписатьСобытиеВЖурнал(ИнформационнаяБаза, Событие) Экспорт
	
	НаборЗаписейЖурналСобытий = РегистрыСведений.ЖурналСобытий.СоздатьНаборЗаписей();
	//НаборЗаписейЖурналСобытий.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
	//НаборЗаписейЖурналСобытий.Прочитать();
	
	ЗаписьЖурналаСобытий = НаборЗаписейЖурналСобытий.Добавить();
	ЗаписьЖурналаСобытий.Период = ТекущаяДата();
	ЗаписьЖурналаСобытий.ИнформационнаяБаза = ИнформационнаяБаза;
	ЗаписьЖурналаСобытий.Событие = Событие;
	
	НаборЗаписейЖурналСобытий.Записать(Ложь);
	
КонецПроцедуры
